Repository: JGrndn/cwDesignerSuite
Catalog: cwGraphAPI/Properties/Resources.*.resx
Languages: fr_fr

# BUTTON_CLOSE
source: Close
fr_fr: Fermer

# CWDESIGNER_ERROR_WHILE_GENERATING
source: An error occured while generating diagram
fr_fr: La génération du diagramme a été interompu

# CWDESIGNER_MANY_DIAGRAM_GENERATED
source: diagrams have been correctly generated
fr_fr: Les diagrammes ont étaient correctement générés

# CWDESIGNER_ONE_DIAGRAM_GENERATED_DONE
source: Your diagram has been correctly generated
fr_fr: Votre diagramme a été correctement généré

# CWDESIGNER_OPEN_DIAGRAM
source: Open the diagram
fr_fr: Ouvrir le diagramme

# ERROR_WARN_MISSING_cwLightObjectType
source: The requested Object Type ID {0} is missing
fr_fr: L'objet type requis avec l'identifiant {0} est manquant

# FORM_ADDITEM_BUTTON_CANCEL
source: Cancel
fr_fr: Annuler

# FORM_ADDITEM_BUTTON_CREATE
source: Create
fr_fr: Créer

# FORM_ADDITEM_ITEM_ALEADY_EXISTS
source: The item already exists, please choose a new name
fr_fr: L'objet existe déjà avec ce nom, veuillez changer le nom

# FORM_ADDITEM_LABEL_SET_ITEM_NAME
source: New auto diagram template
fr_fr: Choisir le nom de votre algorithme

# LAUNCHER_OPTIONS_BUTTONS_BACK_TOOLTIP
source: Return to Models
fr_fr: Retourner au modèles

# LAUNCHER_OPTIONS_BUTTONS_CLOSE_TOOLTIP
source: Close
fr_fr: Fermer

# LAUNCHER_OPTIONS_BUTTONS_OPTIONS_CONTEXT_MENU_ADD_ITEM
source: Add Item
fr_fr: Ajouter un élèment

# LAUNCHER_OPTIONS_BUTTONS_OPTIONS_CONTEXT_MENU_ENABLE_MODEL
source: Enable Model
fr_fr: Activer un modèle

# PSF_CONFIGURATION_NODE_SAVE_KO_BECAUSE_RULES_NOT_RESPECTED
source: Please take care of errors before saving the node.
fr_fr: Veuillez régler les erreurs avant de pouvoir sauvegarder.

# PSF_CONFIGURATION_NODE_SAVE_OK
source: The node has been saved.
fr_fr: Le noeud a été bien sauvegardé

# PSF_PROPERTY_FORMAT_ERROR
source: Next Step
fr_fr: Prochaine Etape

# PSF_PROPERTY_VALUE_CANT_BE_EMPTY
source: The value can't be empty
fr_fr: La valeur ne peut être vide

# PSF_VALIDATION_RULE_TOOLTIP_TITLE_VALIDATION_ERROR
source: Next Step
fr_fr: Prochaine étape

# PSF_VN_CANT_DELETE_FROM_GUI
source: Impossible to delete the root node, Please use the Casewise Administrator to delete the item
fr_fr: Impossible de supprimer un noeud, veuillez utiliser Casewise Administrator pour cela

# GUI_EDITMODE_GROUPBOXDESIGN_TEXT
source: Layouts
fr_fr: Algorithmes

# PSF_CONFIGURATION_NODE_NODEUUID_HELP
source: The UUID of the object inside the repository
fr_fr: L'UUID du noeud utilisé pour se souvenir de l'élèment dans le référentiel

# PSF_CONFIGURATION_NODE_NODEUUID_NAME
source: Node UUID
fr_fr: UUID du noeud

# PSF_TN_ADD_OBJECT_TYPE
source: Add Object Type
fr_fr: Ajouter un objet type

# PSF_TN_CTX_COLLAPSE
source: Collapse
fr_fr: Replier

# PSF_TN_CTX_DELETE
source: Delete
fr_fr: Supprimer

# PSF_TN_CTX_EXPAND_ALL
source: Expand
fr_fr: Déplier

# PSF_TN_CTX_SAVE
source: Save
fr_fr: Sauvegarder

# PSF_TN_NODE_ASSOCIATION_TYPE_HELP
source: If the association type is used, the selection will be done on the target objects of the provided association type
fr_fr: Si l'association type est séléctionné, les objets du noeud seront les objets destination de l'association type

# PSF_TN_NODE_ASSOCIATION_TYPE_NAME
source: Association Type To Target
fr_fr: L'association type

# PSF_TN_NODE_CTX_ADD_ASSOCIATION_TYPE
source: Add Association Type
fr_fr: Ajouter une association type

# PSF_TN_NODE_NAME_HELP
source: The name of the node in order to find and remeber it easily
fr_fr: Le nom du noeud, afin de s'en souvenir facilement

# PSF_TN_NODE_NAME_NAME
source: Node Name
fr_fr: Nom du noeud

# PSF_TN_NODE_OBJECT_TYPE_HELP
source: The object type you want to run the operation on
fr_fr: L'objet type utilisé pour charger les objets du noeud

# PSF_TN_NODE_OBJECT_TYPE_NAME
source: Object Type
fr_fr: L'objet type

# PSF_TN_NODE_OG_FILTER_AND_HELP
source: To filter the object type using properties, AND condition
fr_fr: Permet de filtrer la liste des objets séléctionnés selon un filtre définie qui sera utilisé en condition ET s'il existe plusieurs filtres

# PSF_TN_NODE_OG_FILTER_AND_NAME
source: Filter Properties (AND)
fr_fr: Filtre sur les propriétés (ET)

# PSF_TN_NODE_OG_OGID_HELP
source: The object group ID is used by the Web Designer in order to select the Object Group
fr_fr: L'identifiant est utilisé par webDesigner pour pourvoir réutiliser le noeud dans l'affichage des page web

# PSF_TN_NODE_OG_OGID_NAME
source: Object Group ID
fr_fr: Identifiant du noeud

# PSF_TN_NODE_OG_SELECTEDPROPERTIES_HELP
source: Select the properties to export (NAME should always be selected : default behaviour)
fr_fr: Selectionner les propriétés que vous souhaitez exporter dans webDesigner afin de les utiliser dans les layouts

# PSF_TN_NODE_OG_SELECTEDPROPERTIES_NAME
source: Selected Properties
fr_fr: Propriétés séléctionnés

# PSF_TN_NODE_OG_SORTON_HELP
source: The property which will be used to sort the objects
fr_fr: La propriété utilisé pour trier les objets

# PSF_TN_NODE_OG_SORTON_NAME
source: Sort On
fr_fr: Trier sur

# PSF_TN_NODE_OG_SORTON_REVERSE_HELP
source: if the sort by should be reversed
fr_fr: Cocher, si vous souhaitez inverser l'ordre du tri

# PSF_TN_NODE_OG_SORTON_REVERSE_NAME
source: Sort Reverse
fr_fr: Inverser le tri

# PSF_TN_POPUP_DELETE_NODE_TEXT
source: Delete Confirmation Required
fr_fr: Confirmation de suppression requis

# PSF_TN_POPUP_DELETE_NODE_TITLE
source: For Node : {0}
fr_fr: Pour le noeud : {0}

# GUI_APPEND_ERROR
source: {0} on node {1} which is a {2}
fr_fr: {0} sur le noeud {1} qui est de type {2}

# PSF_TN_FORMAT_ERROR_ON_PROPERTY
source: Please fill the {0} property with a valid value
fr_fr: Erreur de format sur la propriété {0}

# ERROR_CONFIGURATION_FILE_NOT_FOUND
source: The configuration file for {0} was not found, please create one next to the exe
fr_fr: Le fichier de configuration pour {0} n'existe pas, veuillez créer le fichier .exe.config à côté de l'executable

# PSF_DBLINK_ERROR
source: You connection to the repositroy was closed please re-perform your operation
fr_fr: Votre connexion a ecouhé, veuillez recommencer votre opération.

# APPLICATION_WILL_RESTART
source: The application will now restart.
fr_fr: L'application va maintenant redémarrer

# LAUNCHER_OPTIONS_BUTTONS_HELP_TOOLTIP
source: Help
fr_fr: Aide

# LAUNCHER_OPTIONS_TOOLTIP_ADD_ITEM
source: Add an item
fr_fr: Ajouter un objet

# LAUNCHER_OPTIONS_TOOLTIP_ENABLE_MODEL
source: Enable a model
fr_fr: Activer un modèle

# CTX_DESELECT_ALL
source: Deselect All
fr_fr: Tout deséléctionner

# CTX_SELECT_ALL
source: Select All
fr_fr: Tout séléctionner

# PSF_FILTER_HEADER_OPERATION
source: Operation
fr_fr: Opération

# PSF_FILTER_HEADER_PROPERTY
source: Property
fr_fr: Propriété

# PSF_FILTER_HEADER_VALUE
source: Value
fr_fr: Valeur

# TEXT_WARNING
source: Warning
fr_fr: Avertissement

# TEXT_NO_LICENCE_AVAILABLE
source: No Licence available for this feature.
fr_fr: Pas de licence disponible pour ce produit

# ERROR_OBJETTYPE_IS_NOT_IN_PALETTEENTRY
source: Required Object Type {0} doesn't exists in the template {1} Palette.
fr_fr: L'Object type {0} requis n'existe pas dans la palette du template {1}.

# TEXT_OPERATION_CANCELLED
source: The operation has been cancelled
fr_fr: L'opération a été annulée

# ERROR_XMLIMPORTEXPORT
source: An error occured while enabling the model {0}:{1} please check the error file located {2} for more information.
fr_fr: Une erreur s'est produite pendant l'activation du modèle {0}:{1}, veuillez consulter le fichier {2} pour plus d'information. Merci de vérifier que votre modèle n'est pas vérouillée.

# PSF_TN_LABEL_SHOULD_HAVE_LESSTHAN_255_CHAR
source: Please make sure the required name is under than 255 characters
fr_fr: Merci de vous assurer que votre la taille de votre texte est inférieure à 255 caractères

# TEXT_SAVEREQUIRED_ON_CLOSE
source: You have not saved your configuration, do you wish to save it?
fr_fr: Vous avez oublié de sauvegarder votre opération, souhaitez vous le sauvegarder ?

# TEXT_CATEGORY_UNDEFINED
source: Undefined
fr_fr: Nondéfinie

# TEXT_FALSE
source: False
fr_fr: Faux

# TEXT_TRUE
source: True
fr_fr: Vrai

# LAUNCHER_WARNING_TEXT
source: Casewise Labs - No support is provided by Casewise HelpDesk
fr_fr: Casewise Labs - Aucun support n'est fourni par le HelpDesk Casewise
